# Data load

In [1]:
import numpy as np
import pandas as pd

In [8]:
Gold_df1= pd.read_csv('XAU_1d_data.csv')
Gold_df2= pd.read_csv('XAU_1h_data.csv')

In [7]:
Gold_df1

                        Date;Open;High;Low;Close;Volume
0            2004.06.11 00:00;384;384.8;382.8;384.1;272
1         2004.06.14 00:00;384.3;385.8;381.8;382.8;1902
2         2004.06.15 00:00;382.8;388.8;381.1;388.6;1951
3         2004.06.16 00:00;387.1;389.8;382.6;383.8;2014
4           2004.06.17 00:00;383.6;389.3;383;387.6;1568
...                                                 ...
5386  2025.06.02 00:00;3298.76;3382.86;3295.75;3380....
5387  2025.06.03 00:00;3383.51;3392.19;3333.08;3352....
5388  2025.06.04 00:00;3353.93;3384.64;3343.67;3372....
5389  2025.06.05 00:00;3373.34;3403.42;3339.43;3351....
5390  2025.06.06 00:00;3353.55;3369.26;3353;3368.94;...

[5391 rows x 1 columns]

In [9]:
Gold_df2

                          Date;Open;High;Low;Close;Volume
0               2004.06.11 07:00;384;384.3;383.3;383.8;44
1             2004.06.11 08:00;383.8;384.3;383.1;383.1;41
2             2004.06.11 09:00;383.1;384.1;382.8;383.1;55
3                 2004.06.11 10:00;383;383.8;383;383.6;33
4             2004.06.11 11:00;383.6;383.8;383.5;383.6;23
...                                                   ...
122023  2025.06.06 02:00;3359;3362.58;3357.2;3361.82;1...
122024  2025.06.06 03:00;3361.81;3364.08;3357.33;3359....
122025  2025.06.06 04:00;3359.35;3368.53;3356.12;3363....
122026  2025.06.06 05:00;3363.76;3366.45;3362.04;3363....
122027  2025.06.06 06:00;3363.88;3369.26;3359.35;3368....

[122028 rows x 1 columns]

In [30]:
# Load the data (assuming it's in a CSV file with no header)
df1 = pd.read_csv('XAU_1d_data.csv', header=None, names=['Raw1'])
df2 = pd.read_csv('XAU_1h_data.csv', header=None, names=['Raw2'])

In [31]:
df1

                                                   Raw1
0                       Date;Open;High;Low;Close;Volume
1            2004.06.11 00:00;384;384.8;382.8;384.1;272
2         2004.06.14 00:00;384.3;385.8;381.8;382.8;1902
3         2004.06.15 00:00;382.8;388.8;381.1;388.6;1951
4         2004.06.16 00:00;387.1;389.8;382.6;383.8;2014
...                                                 ...
5387  2025.06.02 00:00;3298.76;3382.86;3295.75;3380....
5388  2025.06.03 00:00;3383.51;3392.19;3333.08;3352....
5389  2025.06.04 00:00;3353.93;3384.64;3343.67;3372....
5390  2025.06.05 00:00;3373.34;3403.42;3339.43;3351....
5391  2025.06.06 00:00;3353.55;3369.26;3353;3368.94;...

[5392 rows x 1 columns]

In [32]:
df2

                                                     Raw2
0                         Date;Open;High;Low;Close;Volume
1               2004.06.11 07:00;384;384.3;383.3;383.8;44
2             2004.06.11 08:00;383.8;384.3;383.1;383.1;41
3             2004.06.11 09:00;383.1;384.1;382.8;383.1;55
4                 2004.06.11 10:00;383;383.8;383;383.6;33
...                                                   ...
122024  2025.06.06 02:00;3359;3362.58;3357.2;3361.82;1...
122025  2025.06.06 03:00;3361.81;3364.08;3357.33;3359....
122026  2025.06.06 04:00;3359.35;3368.53;3356.12;3363....
122027  2025.06.06 05:00;3363.76;3366.45;3362.04;3363....
122028  2025.06.06 06:00;3363.88;3369.26;3359.35;3368....

[122029 rows x 1 columns]

In [34]:
# Split the 'Raw' column by semicolon and expand into new columns
df_split1 = df1['Raw1'].str.split(';', expand=True)
df_split2 = df2['Raw2'].str.split(';', expand=True)

In [35]:
df_split1

                     0        1        2        3        4       5
0                 Date     Open     High      Low    Close  Volume
1     2004.06.11 00:00      384    384.8    382.8    384.1     272
2     2004.06.14 00:00    384.3    385.8    381.8    382.8    1902
3     2004.06.15 00:00    382.8    388.8    381.1    388.6    1951
4     2004.06.16 00:00    387.1    389.8    382.6    383.8    2014
...                ...      ...      ...      ...      ...     ...
5387  2025.06.02 00:00  3298.76  3382.86  3295.75  3380.64  461738
5388  2025.06.03 00:00  3383.51  3392.19  3333.08  3352.91  436080
5389  2025.06.04 00:00  3353.93  3384.64  3343.67  3372.25  420245
5390  2025.06.05 00:00  3373.34  3403.42  3339.43  3351.98  808095
5391  2025.06.06 00:00  3353.55  3369.26     3353  3368.94  120857

[5392 rows x 6 columns]

In [36]:
df_split2

                       0        1        2        3        4       5
0                   Date     Open     High      Low    Close  Volume
1       2004.06.11 07:00      384    384.3    383.3    383.8      44
2       2004.06.11 08:00    383.8    384.3    383.1    383.1      41
3       2004.06.11 09:00    383.1    384.1    382.8    383.1      55
4       2004.06.11 10:00      383    383.8      383    383.6      33
...                  ...      ...      ...      ...      ...     ...
122024  2025.06.06 02:00     3359  3362.58   3357.2  3361.82   10649
122025  2025.06.06 03:00  3361.81  3364.08  3357.33  3359.34   21746
122026  2025.06.06 04:00  3359.35  3368.53  3356.12  3363.77   39028
122027  2025.06.06 05:00  3363.76  3366.45  3362.04   3363.9   25151
122028  2025.06.06 06:00  3363.88  3369.26  3359.35  3368.94   15458

[122029 rows x 6 columns]

In [42]:
# Rename columns appropriately
df_split1.columns = ['Date', 'Open', 'High', 'Low', 'Close', 'Volume']
df_split2.columns = ['Date', 'Open', 'High', 'Low', 'Close', 'Volume']

In [44]:
# Convert numeric columns to appropriate data types
numeric_cols1 = ['Open', 'High', 'Low', 'Close', 'Volume']
df_split1[numeric_cols1] = df_split1[numeric_cols1].apply(pd.to_numeric, errors='coerce')

numeric_cols2 = ['Open', 'High', 'Low', 'Close', 'Volume']
df_split2[numeric_cols2] = df_split2[numeric_cols2].apply(pd.to_numeric, errors='coerce')

In [47]:
df_split1.head()

               Date   Open   High    Low  Close  Volume
0              Date    NaN    NaN    NaN    NaN     NaN
1  2004.06.11 00:00  384.0  384.8  382.8  384.1   272.0
2  2004.06.14 00:00  384.3  385.8  381.8  382.8  1902.0
3  2004.06.15 00:00  382.8  388.8  381.1  388.6  1951.0
4  2004.06.16 00:00  387.1  389.8  382.6  383.8  2014.0

In [48]:
df_split2.head()

               Date   Open   High    Low  Close  Volume
0              Date    NaN    NaN    NaN    NaN     NaN
1  2004.06.11 07:00  384.0  384.3  383.3  383.8    44.0
2  2004.06.11 08:00  383.8  384.3  383.1  383.1    41.0
3  2004.06.11 09:00  383.1  384.1  382.8  383.1    55.0
4  2004.06.11 10:00  383.0  383.8  383.0  383.6    33.0

In [49]:
df_split1.tail()

                  Date     Open     High      Low    Close    Volume
5387  2025.06.02 00:00  3298.76  3382.86  3295.75  3380.64  461738.0
5388  2025.06.03 00:00  3383.51  3392.19  3333.08  3352.91  436080.0
5389  2025.06.04 00:00  3353.93  3384.64  3343.67  3372.25  420245.0
5390  2025.06.05 00:00  3373.34  3403.42  3339.43  3351.98  808095.0
5391  2025.06.06 00:00  3353.55  3369.26  3353.00  3368.94  120857.0

In [50]:
df_split2.tail()

                    Date     Open     High      Low    Close   Volume
122024  2025.06.06 02:00  3359.00  3362.58  3357.20  3361.82  10649.0
122025  2025.06.06 03:00  3361.81  3364.08  3357.33  3359.34  21746.0
122026  2025.06.06 04:00  3359.35  3368.53  3356.12  3363.77  39028.0
122027  2025.06.06 05:00  3363.76  3366.45  3362.04  3363.90  25151.0
122028  2025.06.06 06:00  3363.88  3369.26  3359.35  3368.94  15458.0

In [51]:
df_split1.info()
df_split2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5392 entries, 0 to 5391
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    5392 non-null   object
 1   Open    5391 non-null   float64
 2   High    5391 non-null   float64
 3   Low     5391 non-null   float64
 4   Close   5391 non-null   float64
 5   Volume  5391 non-null   float64
dtypes: float64(5), object(1)
memory usage: 252.9+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 122029 entries, 0 to 122028
Data columns (total 6 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   Date    122029 non-null  object
 1   Open    122028 non-null  float64
 2   High    122028 non-null  float64
 3   Low     122028 non-null  float64
 4   Close   122028 non-null  float64
 5   Volume  122028 non-null  float64
dtypes: float64(5), object(1)
memory usage: 5.6+ MB

# Data Visualization

In [53]:
import matplotlib.pyplot as plt
import pandas as pd

# Sample: Make sure your 'Date' column is datetime
df_split1['Date'] = pd.to_datetime(df_split1['Date'])

# Optional: Plot last 10 records to avoid clutter in labels
df1 = df_split1.tail(10)

plt.figure(figsize=(12, 6))
plt.plot(df1['Date'], df1['Close'], marker='o', color='blue', label='Close Price')

# Add data labels
for i in range(len(df_sample)):
    plt.text(df1['Date'].iloc[i], 
             df1['Close'].iloc[i] + 2,  # slightly above the point
             f"{df1['Close'].iloc[i]:.2f}", 
             ha='center', fontsize=9, color='black')

plt.title('Stock Close Prices (Last 10 Days)')
plt.xlabel('Date')
plt.ylabel('Close Price')
plt.xticks(rotation=45)
plt.grid(True)
plt.legend()
plt.tight_layout()
plt.show()

C:\Users\Shubh\AppData\Local\Temp\ipykernel_24444\2997082647.py:5: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df_split1['Date'] = pd.to_datetime(df_split1['Date'])

DateParseError: Unknown datetime string format, unable to parse: Date, at position 0